TexasInstruments/mcupsdk-core/examples/drivers/resolver/resolver_angle_speed/am263px-cc/r5fss0-0_nortos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM263Px" --package "ZCZ_S" --part "AM263P4" --context "r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.18.0+3266"}
 */

/**
 * Import the modules used in this configuration.
 */
const eeprom             = scripting.addModule("/board/eeprom/eeprom", {}, false);
const eeprom1            = eeprom.addInstance();
const pmic               = scripting.addModule("/board/pmic/pmic", {}, false);
const pmic1              = pmic.addInstance();
const epwm               = scripting.addModule("/drivers/epwm/epwm", {}, false);
const epwm1              = epwm.addInstance();
const epwm2              = epwm.addInstance();
const i2c                = scripting.addModule("/drivers/i2c/i2c", {}, false);
const i2c1               = i2c.addInstance();
const i2c2               = i2c.addInstance();
const mcspi              = scripting.addModule("/drivers/mcspi/mcspi", {}, false);
const mcspi1             = mcspi.addInstance();
const resolver           = scripting.addModule("/drivers/resolver/resolver", {}, false);
const resolver1          = resolver.addInstance();
const debug_log          = scripting.addModule("/kernel/dpl/debug_log");
const dpl_cfg = scripting.addModule("/kernel/dpl/dpl_cfg");
const mpu_armv7          = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71         = mpu_armv7.addInstance();
const mpu_armv72         = mpu_armv7.addInstance();
const mpu_armv73         = mpu_armv7.addInstance();
const mpu_armv74         = mpu_armv7.addInstance();
const mpu_armv75         = mpu_armv7.addInstance();
const mpu_armv76         = mpu_armv7.addInstance();
const default_linker     = scripting.addModule("/memory_configurator/default_linker", {}, false);
const default_linker1    = default_linker.addInstance();
const general            = scripting.addModule("/memory_configurator/general", {}, false);
const general1           = general.addInstance();
const region             = scripting.addModule("/memory_configurator/region", {}, false);
const region1            = region.addInstance();
const section            = scripting.addModule("/memory_configurator/section", {}, false);
const section1           = section.addInstance();
const section2           = section.addInstance();
const section3           = section.addInstance();
const section4           = section.addInstance();
const section5           = section.addInstance();
const section6           = section.addInstance();
const section7           = section.addInstance();
const section8           = section.addInstance();
const section9           = section.addInstance();
const section10          = section.addInstance();
const section11          = section.addInstance();
const section12          = section.addInstance();
const epwm_syncout_xbar  = scripting.addModule("/xbar/epwm_syncout_xbar/epwm_syncout_xbar", {}, false);
const epwm_syncout_xbar1 = epwm_syncout_xbar.addInstance();
const int_xbar           = scripting.addModule("/xbar/int_xbar/int_xbar", {}, false);
const int_xbar1          = int_xbar.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
eeprom1.$name = "CONFIG_EEPROM0";

pmic1.$name = "CONFIG_PMIC0";

epwm1.$name                         = "CONFIG_EPWM0";
epwm1.epwmTimebase_syncOutPulseMode = ["EPWM_SYNC_OUT_PULSE_ON_SOFTWARE"];
epwm1.epwmTimebase_emulationMode    = "EPWM_EMULATION_FREE_RUN";
epwm1.epwmTimebase_period           = 9999;
epwm1.EPWM.$assign                  = "EPWM0";

epwm2.$name                                          = "CONFIG_EPWM1";
epwm2.epwmTimebase_periodLoadEvent                   = "EPWM_SHADOW_LOAD_MODE_SYNC";
epwm2.epwmTimebase_period                            = 9999;
epwm2.epwmTimebase_syncInPulseSource                 = "EPWM_SYNC_IN_PULSE_SRC_SYNCOUT_EPWM0";
epwm2.epwmCounterCompare_cmpA                        = 20;
epwm2.epwmCounterCompare_enableShadowLoadModeCMPA    = false;
epwm2.epwmEventTrigger_enableInterrupt               = true;
epwm2.epwmEventTrigger_interruptSource               = "EPWM_INT_TBCTR_U_CMPA";
epwm2.epwmEventTrigger_interruptEventCount           = "1";
epwm2.epwmEventTrigger_interruptEventCountInitEnable = true;
epwm2.epwmTimebase_emulationMode                     = "EPWM_EMULATION_FREE_RUN";
epwm2.epwmTimebase_counterMode                       = "EPWM_COUNTER_MODE_UP";
epwm2.EPWM.$assign                                   = "EPWM1";

i2c1.$name           = "IOEXPANDER_I2C_INSTANCE";
i2c1.I2C.$assign     = "I2C2";
i2c1.I2C.SCL.$assign = "UART0_RTSn";
i2c1.I2C.SDA.$assign = "UART0_CTSn";

i2c2.$name               = "EEPROM_I2C_INSTANCE";
eeprom1.peripheralDriver = i2c2;
i2c2.I2C.$assign         = "I2C0";

mcspi1.$name                 = "CONFIG_MCSPI0";
pmic1.peripheralDriver       = mcspi1;
mcspi1.SPI.$assign           = "SPI1";
mcspi1.mcspiChannel[0].$name = "CONFIG_MCSPI_CH0";
mcspi1.child.$name           = "drivers_mcspi_v1_mcspi_v1_template1";

const edma                  = scripting.addModule("/drivers/edma/edma", {}, false);
const edma1                 = edma.addInstance({}, false);
edma1.$name                 = "CONFIG_EDMA0";
mcspi1.edmaDriver           = edma1;
edma1.edmaRmDmaCh[0].$name  = "CONFIG_EDMA_RM0";
edma1.edmaRmQdmaCh[0].$name = "CONFIG_EDMA_RM1";
edma1.edmaRmTcc[0].$name    = "CONFIG_EDMA_RM2";
edma1.edmaRmParam[0].$name  = "CONFIG_EDMA_RM3";

resolver1.$name                        = "CONFIG_RESOLVER0";
resolver1.syncInEnable                 = true;
resolver1.advConfig                    = true;
resolver1.resolverSignalMode           = "RDC_SINGALMODE_SINGLE_ENDED";
resolver1.idealSampleOverride          = 7;
resolver1.core0IdealSampleModeAdv      = "RDC_IDEAL_SAMPLE_TIME_MODE_3_AUTO_DETECT_OFF";
resolver1.core0bandPassFilterEnable    = true;
resolver1.core1PgCosGainBypassValueAdv = 24960;
resolver1.core1PgSinGainBypassValueAdv = 24960;
resolver1.adcSocWidth                  = 30;
resolver1.core0PgSinGainBypassValueAdv = 25000;
resolver1.core0PgCosGainBypassValueAdv = 25000;
resolver1.RESOLVER.PWM0.$assign        = "PR0_PRU1_GPIO10";

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

